Revit 2026 API

# ColorFillLegendHeight Property

---

The height of the legend.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Height { get; set; }
```
```vb
Public Property Height As Double
	Get
	Set
```
```cpp
public:
property double Height {
	double get ();
	void set (double value);
}
```
```fsharp
member Height : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: The given value for height must be positive. |

Changing the height may result in a change in the count of columns.

#### Reference

ColorFillLegend Class

Autodesk.Revit.DB Namespace